{ "books" : [
    {
        "title": "Ruby Best Practices",
        "author": "Gregory Brown",
        "authorUrl": "http://blog.rubybestpractices.com/",
        "level": "Modarate",
        "info": "Ruby Best Practices is for programmers who want to use Ruby as experienced Rubyists do. Written by the developer of the Ruby project Prawn, this book explains how to design beautiful APIs and domain-specific languages with Ruby, as well as how to work with functional programming ideas and techniques that can simplify your code and make you more productive.",
        "url": "http://blog.rubybestpractices.com/posts/gregory/022-rbp-now-open.html",
        "cover": "img/cover_RubyBestPractices.png"
    },
    {
        "title": "Mr. Neighborly's Humble Little Ruby Book",
        "author": "Mr. Neighborly",
        "authorUrl": "http://humblelittlerubybook.com",
        "level": "Beginner",
        "info": "Another quirky beginner's guide is Mr. Neighborly's Humble Little Ruby Book by Jeremy McAnally. This one is a little more conventional than the Poignant Guide, but still contains a strong authorial voice.",
        "url": "http://humblelittlerubybook.com",
        "cover": "img/humble.jpg"
    },
    {
        "title": "Learn to Program",
        "author": "Mr. Neighborly",
        "authorUrl": "http://pine.fm/LearnToProgram/",
        "level": "Beginner",
        "info": "Learn to Program by Chris Pine is a popular beginner's book on programming that centers using Ruby as its starter language.",
        "url": "http://pine.fm/LearnToProgram/",
        "cover": "img/learntoprogram.jpg"
    },
    {
        "title": "Computer Science Programming Basics in Ruby",
        "author": "O'Reilly Media",
        "authorUrl": "http://it-ebooks.info/book/2262/",
        "level": "Modarate",
        "info": "f you know basic high-school math, you can quickly learn and apply the core concepts of computer science with this concise, hands-on book. Led by a team of experts, you'll quickly understand the difference between computer science and computer programming, and you'll learn how algorithms help you solve computing problems.",
        "url": "http://it-ebooks.info/book/2262/",
        "cover": "img/computer_science.jpg"
    },
    {
        "title": "Ruby on Rails Tutorial: Learn Web Development with Rails (2nd edition)",
        "author": "Michael Hartl",
        "authorUrl": "http://ruby.railstutorial.org/",
        "level": "Modarate",
        "info": "The Ruby on Rails Tutorial, 2nd Edition book and screencast series teach you how to develop and deploy real, industrial-strength web applications with Ruby on Rails, the open-source web framework that powers top websites such as Twitter, Hulu, GitHub, and the Yellow Pages. The Ruby on Rails Tutorial book is available for free online and is available for purchase as an ebook (PDF, EPUB, and MOBI formats).",
        "url": "http://ruby.railstutorial.org/",
        "cover": "img/railstutorial.png"
    },
    {
        "title": "PLEAC-Ruby",
        "author": "Pleac Project",
        "authorUrl": "http://pleac.sourceforge.net/",
        "level": "Beginner",
        "info": "Following the Perl Cookbook (by Tom Christiansen and Nathan Torkington, published by O'Reilly) spirit, the PLEAC Project aims to gather fans of programming, in order to implement the solutions in other programming languages. In this document, you'll find an implementation of the Solutions of the Perl Cookbook in the Ruby language.",
        "url": "http://pleac.sourceforge.net/pleac_ruby/index.html",
        "cover": "img/placeholder.gif"
    },
    {
        "title": "Why Ruby?",
        "author": "David Hansson",
        "authorUrl": "http://david.heinemeierhansson.com/",
        "level": "Beginner",
        "info": "In this recent lecture from Ruby Conf 2010, David Hansson, the creator of Ruby on Rails, focuses less on coding techniques, and more on the Ruby philosophy, in general. What makes a language like Ruby preferable to its peers? David provides his answer.",
        "url": "http://net.tutsplus.com/articles/lectures/why-ruby/",
        "cover": "img/why_ruby.jpg"
    }
]}